[
  {
    "id": "7wgnp6s5samm",
    "title": "Chainsaw Man – The Movie: Reze Arc Anime Gets 2025 Premiere in Japan",
    "slug": "chainsaw-man-the-movie-reze-arc-anime-gets-2025-premiere-in-japan",
    "formatCategory": "anime",
    "contentCategory": "haber",
    "tags": [
      "Chainsaw Man - The Movie: Reze Arc",
      "Chainsaw Man",
      "shounen",
      "trailer"
    ],
    "thumbnail": "chainsaw-man-the-movie-reze-arc-anime-gets-2025-premiere-in-japan.avif",
    "createdAt": "2025-04-15T23:30:16.063Z",
    "editDates": [
      "2025-04-16T00:15:45.980Z",
      "2025-04-16T00:15:46.798Z",
      "2025-04-16T00:15:55.299Z",
      "2025-04-16T00:15:57.538Z",
      "2025-04-16T00:16:03.553Z",
      "2025-04-16T00:16:04.270Z",
      "2025-04-16T00:18:29.352Z",
      "2025-04-16T00:18:34.254Z",
      "2025-04-16T00:51:19.807Z",
      "2025-04-16T00:51:22.695Z"
    ],
    "author": "veli",
    "status": true,
    "content": [
      {
        "type": "paragraph",
        "data": {
          "text": "Chainsaw Man set the stage today at Jump Festa 2025 with the first full look at the upcoming Chainsaw Man – The Movie: Reze Arc, after announcing the anime film last year on the same stage. The brand new trailer revealed a 2025 release date for Japan, and two key visuals — one showing Chainsaw Man and the other previewing Denji and Reze."
        }
      },
      {
        "type": "youtube",
        "data": {
          "url": "https://www.youtube.com/watch?v=d1n552v1ng0"
        }
      },
      {
        "type": "image",
        "data": {
          "filename": "7wgnp6s5samm-1.webp"
        }
      },
      {
        "type": "image",
        "data": {
          "filename": "7wgnp6s5samm-2.webp"
        }
      },
      {
        "type": "paragraph",
        "data": {
          "text": "Tatsuya Yoshihara, who previously directed the fourth and tenth episodes of the TV anime series and directed much of the Black Clover TV anime, is now slated as director for the movie. Hiroshi Seko returns to write the script along with Kazutaka Sugiyama as Character Designer, all at MAPPA. Souta Yamazaki is now credited as Sub Character Designer, with Sota Shigetsugu as Action Animation Director and Shoichi as the Main Animator. Riki Matsuura will design the devils alongside Kiyotaka Oshiyama, who is fresh off directing the anime film Look Back."
        }
      },
      {
        "type": "paragraph",
        "data": {
          "text": "The Chainsaw Man TV anime, based on the manga of the same name by Tatsuki Fujimoto, premiered in Japan on October 11, 2022, with Crunchyroll streaming the anime as it aired. Crunchyroll describes the series as such:"
        }
      },
      {
        "type": "quote",
        "data": {
          "text": "Denji is a teenage boy living with a Chainsaw Devil named Pochita. Due to the debt his father left behind, he has been living a rock-bottom life while repaying his debt by harvesting devil corpses with Pochita.\n\nOne day, Denji is betrayed and killed. As his consciousness fades, he makes a contract with Pochita and gets revived as \"Chainsaw Man\" — a man with a devil's heart.",
          "subtext": ""
        }
      }
    ]
  },
  {
    "id": "vq2ruh04w6yd",
    "title": "Go! Go! Loser Ranger! Anime Dances into Season 2 with Creditless Opening and Ending Movies",
    "slug": "go-go-loser-ranger-anime-dances-into-season-2-with-creditless-opening-and-ending-movies",
    "formatCategory": "anime",
    "contentCategory": "haber",
    "tags": [
      "Go! Go! Loser Ranger!",
      "premiere",
      "date"
    ],
    "thumbnail": "go-go-loser-ranger-anime-dances-into-season-2-with-creditless-opening-and-ending-movies.webp",
    "createdAt": "2025-04-16T02:09:33.439Z",
    "editDates": [],
    "author": "veli",
    "status": true,
    "content": [
      {
        "type": "paragraph",
        "data": {
          "text": "It's almost time for the Sunday Showdown to return! Go! Go! Loser Ranger! season 2 premieres worldwide on April 13, but you can sneak a peek at the new opening and ending now.\n\nCheck out a creditless cut of the opening, set to \"Maji de Sekai Kaechau 5-byou Mae\" by ORANGE RANGE:"
        }
      },
      {
        "type": "youtube",
        "data": {
          "url": "https://www.youtube.com/watch?v=TGgGPPQmtk4"
        }
      },
      {
        "type": "paragraph",
        "data": {
          "text": "Then chill out with the video game inspired ending, set to \"Seigi\" by Fukurow note:"
        }
      },
      {
        "type": "youtube",
        "data": {
          "url": "https://www.youtube.com/watch?v=e0Wv9Iu4EhE"
        }
      },
      {
        "type": "image",
        "data": {
          "filename": "vq2ruh04w6yd-1.webp"
        }
      },
      {
        "type": "paragraph",
        "data": {
          "text": "Keiichi Sato (Tiger & Bunny) directs Go! Go! Loser Ranger! at studio Yostar Pictures, with Keiichiro Ochi (UNDER NINJA) on series composition, Kahoko Koseki on character designs and Yoshihiro Ike (Akiba Maid War) on music. The series is based on the manga by Negi Haruba, with an English translation available from Kodansha both by the volume and simulpubbed on the K MANGA app.\n\nDisney+ and Hulu stream the series worldwide and describe the story:"
        }
      },
      {
        "type": "quote",
        "data": {
          "text": "What if the 13-year-long battle for survival that had been ongoing between the monsters and the Ranger Force was actually a farce all along? With their old hideout and bosses wiped out, the surviving Dusters make a secret agreement with the Ranger Force to engage in the weekly Sunday Showdown - one where they will always be defeated. Tired of this charade, Fighter D finally steps up to make a change once and for all!",
          "subtext": "Source: SHOCHIKU Anime Channel"
        }
      }
    ]
  }
]